Tekla Open API Reference for Tekla Structures 2025
Localization.GetLocalizationFileFullPath Method
 Returns localization file if found from environment
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static string GetLocalizationFileFullPath(
	string fileName
)
Public Shared Function GetLocalizationFileFullPath (
	fileName As String
) As String
Parameters
fileName
Type: System.String
filename to search
Return Value
Type: String
[Missing <returns> documentation for "M:Tekla.Structures.Dialog.Localization.GetLocalizationFileFullPath(System.String)"]
See Also
Reference
Localization Class
Tekla.Structures.Dialog Namespace